# Camera Class

---
A collection of camera settings for the current view.
SystemObject Autodesk.Revit.DB.DirectContext3DCamera
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Camera : IDisposable

    Public Class Camera
    	Implements IDisposable

    public ref class Camera : IDisposable

    type Camera =
        class
            interface IDisposable
        end
The Camera type exposes the following members.
| Name| Description
---|---|---
| Camera|  Camera
Top
| Name| Description
---|---|---
| EyePosition|  Camera's position in the world
| FarDistance|  Distance to far clipping plane
| HorizontalExtent|  Horizontal extent of the camera's view, measured at target distance.
| HorizontalOffset|  Horizontal offset of the camera's view center from target, measured at target distance.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| NearDistance|  Distance to near clipping plane
| ProjectionMethod|  Projection method
| TargetDistance|  Distance from camera to its target
| UpDirection|  Up direction of the camera
| VerticalExtent|  Vertical extent of the camera's view, measured at target distance.
| VerticalOffset|  Vertical offset of the camera's view center from target, measured at target distance.
| ViewDirection|  Direction that the camera is facing
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the Camera
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
| Transform|  Transforms the camera
Top
The current Camera can be obtained from DrawContext
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace